UU5JPP/Wolf-LITE/STM32/Core/Src/front_unit.c
void FRONTPANEL_BUTTONHANDLER_AGC(void)
{
	CurrentVFO()->AGC = !CurrentVFO()->AGC;
	int8_t band = getBandFromFreq(CurrentVFO()->Freq, true);
	if (band > 0)
		TRX.BANDS_SAVED_SETTINGS[band].AGC = CurrentVFO()->AGC;
	LCD_UpdateQuery.TopButtons = true;
	NeedSaveSettings = true;
}

void FRONTPANEL_BUTTONHANDLER_AGC_SPEED(void)
{
	if (!LCD_systemMenuOpened)
	{
		LCD_systemMenuOpened = true;
		SYSMENU_AUDIO_AGC_HOTKEY();
	}
	else
	{
		eventCloseAllSystemMenu();
	}
	LCD_redraw(false);
}

static void FRONTPANEL_BUTTONHANDLER_SQUELCH(void)
{
	if (!LCD_systemMenuOpened)
	{
		LCD_systemMenuOpened = true;
		SYSMENU_AUDIO_SQUELCH_HOTKEY();
	}
	else
	{
		eventCloseAllSystemMenu();
	}
	LCD_redraw(false);
}

static void FRONTPANEL_BUTTONHANDLER_WPM(void)
{
	if (!LCD_systemMenuOpened)
	{
		LCD_systemMenuOpened = true;
		SYSMENU_CW_WPM_HOTKEY();
	}
	else
	{
		eventCloseAllSystemMenu();
	}
	LCD_redraw(false);
}

static void FRONTPANEL_BUTTONHANDLER_KEYER(void)
{
	TRX.CW_KEYER = !TRX.CW_KEYER;
	if(TRX.CW_KEYER)
		LCD_showTooltip("KEYER ON");
	else
		LCD_showTooltip("KEYER OFF");
}

static void FRONTPANEL_BUTTONHANDLER_STEP(void)
{
	if (!LCD_systemMenuOpened)
	{
		LCD_systemMenuOpened = true;
		SYSMENU_TRX_STEP_HOTKEY();
	}
	else
	{
		eventCloseAllSystemMenu();
	}
	LCD_redraw(false);
}

void FRONTPANEL_BUTTONHANDLER_BW(void)
{
	if (!LCD_systemMenuOpened)
	{
		LCD_systemMenuOpened = true;
		if (CurrentVFO()->Mode == TRX_MODE_CW_L || CurrentVFO()->Mode == TRX_MODE_CW_U)
			SYSMENU_AUDIO_BW_CW_HOTKEY();
		else if (CurrentVFO()->Mode == TRX_MODE_NFM || CurrentVFO()->Mode == TRX_MODE_WFM)
			SYSMENU_AUDIO_BW_FM_HOTKEY();
		else if (CurrentVFO()->Mode == TRX_MODE_AM)
			SYSMENU_AUDIO_BW_AM_HOTKEY();
		else
			SYSMENU_AUDIO_BW_SSB_HOTKEY();
	}
	else
	{
		eventCloseAllSystemMenu();
	}
	LCD_redraw(false);
}

void FRONTPANEL_BUTTONHANDLER_VOLUME(void)
{
	if (!LCD_systemMenuOpened)
	{
		LCD_systemMenuOpened = true;
		SYSMENU_AUDIO_VOLUME_HOTKEY();
	}
	else
	{
		eventCloseAllSystemMenu();
	}
	LCD_redraw(false);
}

void FRONTPANEL_BUTTONHANDLER_HPF(void)
{
	if (!LCD_systemMenuOpened)
	{
		LCD_systemMenuOpened = true;
		if (CurrentVFO()->Mode == TRX_MODE_CW_L || CurrentVFO()->Mode == TRX_MODE_CW_U)
			SYSMENU_AUDIO_HPF_CW_HOTKEY();
		else
			SYSMENU_AUDIO_HPF_SSB_HOTKEY();
	}
	else
	{
		eventCloseAllSystemMenu();
	}
	LCD_redraw(false);
}

void FRONTPANEL_BUTTONHANDLER_ArB(void) //A=B
{
	if (TRX.current_vfo)
		memcpy(&TRX.VFO_A, &TRX.VFO_B, sizeof TRX.VFO_B);
	else
		memcpy(&TRX.VFO_B, &TRX.VFO_A, sizeof TRX.VFO_B);
	
	LCD_showTooltip("VFO COPIED");
	
	LCD_UpdateQuery.TopButtons = true;
	LCD_UpdateQuery.FreqInfo = true;
	NeedSaveSettings = true;
}

void FRONTPANEL_BUTTONHANDLER_NOTCH(void)
{
	TRX_TemporaryMute();
	
	if (CurrentVFO()->NotchFC > CurrentVFO()->LPF_Filter_Width)
	{
		CurrentVFO()->NotchFC = CurrentVFO()->LPF_Filter_Width;
	}
	
	if (!CurrentVFO()->AutoNotchFilter)
	{
		InitAutoNotchReduction();
		CurrentVFO()->AutoNotchFilter = true;
	}
	else
		CurrentVFO()->AutoNotchFilter = false;

	LCD_UpdateQuery.StatusInfoGUI = true;
	LCD_UpdateQuery.TopButtons = true;
	NeedSaveSettings = true;
}

void FRONTPANEL_BUTTONHANDLER_NOTCH_MANUAL(void)
{
	if (CurrentVFO()->NotchFC > CurrentVFO()->LPF_Filter_Width)
		CurrentVFO()->NotchFC = CurrentVFO()->LPF_Filter_Width;
	CurrentVFO()->AutoNotchFilter = false;

	LCD_UpdateQuery.TopButtons = true;
	LCD_UpdateQuery.StatusInfoGUI = true;
	NeedSaveSettings = true;
}

static void FRONTPANEL_BUTTONHANDLER_SHIFT(void)
{
	TRX.ShiftEnabled = !TRX.ShiftEnabled;
	LCD_UpdateQuery.TopButtons = true;
	NeedSaveSettings = true;
}

static void FRONTPANEL_BUTTONHANDLER_CLAR(void)
{
	TRX.CLAR = !TRX.CLAR;
	LCD_UpdateQuery.TopButtons = true;
	NeedSaveSettings = true;
}

void FRONTPANEL_BUTTONHANDLER_LOCK(void)
{
	if (!LCD_systemMenuOpened)
		TRX.Locked = !TRX.Locked;
	LCD_UpdateQuery.TopButtons = true;
	LCD_UpdateQuery.StatusInfoBar = true;
	NeedSaveSettings = true;
}

static void FRONTPANEL_BUTTONHANDLER_HIDDEN_ENABLE(void)
{
	if (LCD_systemMenuOpened)
	{
		sysmenu_hiddenmenu_enabled = true;
		LCD_redraw(false);
	}
	LCD_UpdateQuery.TopButtons = true;
	LCD_UpdateQuery.StatusInfoBar = true;
	NeedSaveSettings = true;
}

void FRONTPANEL_BUTTONHANDLER_MENU(void)
{
	if (!LCD_systemMenuOpened)
		LCD_systemMenuOpened = true;
	else
		eventCloseSystemMenu();
	LCD_redraw(false);
}

void FRONTPANEL_BUTTONHANDLER_MUTE(void)
{
	TRX_Mute = !TRX_Mute;
	LCD_UpdateQuery.TopButtons = true;
	NeedSaveSettings = true;
}

static void FRONTPANEL_BUTTONHANDLER_BANDMAP(void)
{
	TRX.BandMapEnabled = !TRX.BandMapEnabled;
	
	if(TRX.BandMapEnabled)
		LCD_showTooltip("BANDMAP ON");
	else
		LCD_showTooltip("BANDMAP OFF");
	
	LCD_UpdateQuery.TopButtons = true;
	NeedSaveSettings = true;
}

static uint16_t FRONTPANEL_ReadMCP3008_Value(uint8_t channel, GPIO_TypeDef *CS_PORT, uint16_t CS_PIN)
{
	uint8_t outData[3] = {0};
	uint8_t inData[3] = {0};
	uint16_t mcp3008_value = 0;

	outData[0] = 0x18 | channel;
	bool res = SPI_Transmit(outData, inData, 3, CS_PORT, CS_PIN, false, SPI_FRONT_UNIT_PRESCALER);
	if (res == false)
		return 65535;
	mcp3008_value = (uint16_t)(0 | ((inData[1] & 0x3F) << 4) | (inData[2] & 0xF0 >> 4));

	//sendToDebug_uint16(mcp3008_value, false);
	return mcp3008_value;
}

static void FRONTPANEL_BUTTONHANDLER_PWR_P(void)
{
	int16_t newval = (int16_t)TRX.RF_Power + 10;
	newval /= 10;
	newval *= 10;
	if(newval > 100)
		newval = 100;
	TRX.RF_Power = newval;
	char str[32] = {0};
	sprintf(str, "PWR: %d%%",TRX.RF_Power);
	LCD_showTooltip(str);
	NeedSaveSettings = true;
}

static void FRONTPANEL_BUTTONHANDLER_PWR_N(void)
{
	int16_t newval = (int16_t)TRX.RF_Power - 10;
	newval /= 10;
	newval *= 10;
	if(newval < 0)
		newval = 0;
	TRX.RF_Power = newval;
	char str[32] = {0};
	sprintf(str, "PWR: %d%%",TRX.RF_Power);
	LCD_showTooltip(str);
	NeedSaveSettings = true;
}

static void FRONTPANEL_BUTTONHANDLER_BW_P(void)
{
	char str[32] = {0};
	switch (CurrentVFO()->Mode)
	{
		case TRX_MODE_LSB:
		case TRX_MODE_USB:
		case TRX_MODE_DIGI_L:
		case TRX_MODE_DIGI_U:
		case TRX_MODE_IQ:
		case TRX_MODE_LOOPBACK:
		case TRX_MODE_NO_TX:
			if (TRX.SSB_LPF_Filter == 0)
				TRX.SSB_LPF_Filter = 1400;
			if (TRX.SSB_LPF_Filter == 1400)
				TRX.SSB_LPF_Filter = 1600;
			else if (TRX.SSB_LPF_Filter == 1600)
				TRX.SSB_LPF_Filter = 1800;
			else if (TRX.SSB_LPF_Filter == 1800)
				TRX.SSB_LPF_Filter = 2100;
			else if (TRX.SSB_LPF_Filter == 2100)
				TRX.SSB_LPF_Filter = 2300;
			else if (TRX.SSB_LPF_Filter == 2300)
				TRX.SSB_LPF_Filter = 2500;
			else if (TRX.SSB_LPF_Filter == 2500)
				TRX.SSB_LPF_Filter = 2700;
			else if (TRX.SSB_LPF_Filter == 2700)
				TRX.SSB_LPF_Filter = 2900;
			else if (TRX.SSB_LPF_Filter == 2900)
				TRX.SSB_LPF_Filter = 3000;
			else if (TRX.SSB_LPF_Filter == 3000)
				TRX.SSB_LPF_Filter = 3200;
			else if (TRX.SSB_LPF_Filter == 3200)
				TRX.SSB_LPF_Filter = 3400;
			sprintf(str, "BW: %d",TRX.SSB_LPF_Filter);
		break;
		
		case TRX_MODE_CW_L:
		case TRX_MODE_CW_U:
			if (TRX.CW_LPF_Filter == 100)
				TRX.CW_LPF_Filter = 150;
			else if (TRX.CW_LPF_Filter == 150)
				TRX.CW_LPF_Filter = 200;
			else if (TRX.CW_LPF_Filter == 200)
				TRX.CW_LPF_Filter = 250;
			else if (TRX.CW_LPF_Filter == 250)
				TRX.CW_LPF_Filter = 300;
			else if (TRX.CW_LPF_Filter == 300)
				TRX.CW_LPF_Filter = 350;
			else if (TRX.CW_LPF_Filter == 350)
				TRX.CW_LPF_Filter = 400;
			else if (TRX.CW_LPF_Filter == 400)
				TRX.CW_LPF_Filter = 450;
			else if (TRX.CW_LPF_Filter == 450)
				TRX.CW_LPF_Filter = 500;
			else if (TRX.CW_LPF_Filter == 500)
				TRX.CW_LPF_Filter = 550;
			else if (TRX.CW_LPF_Filter == 550)
				TRX.CW_LPF_Filter = 600;
			else if (TRX.CW_LPF_Filter == 600)
				TRX.CW_LPF_Filter = 650;
			else if (TRX.CW_LPF_Filter == 650)
				TRX.CW_LPF_Filter = 700;
			else if (TRX.CW_LPF_Filter == 700)
				TRX.CW_LPF_Filter = 750;
			else if (TRX.CW_LPF_Filter == 750)
				TRX.CW_LPF_Filter = 800;
			else if (TRX.CW_LPF_Filter == 800)
				TRX.CW_LPF_Filter = 850;
			else if (TRX.CW_LPF_Filter == 850)
				TRX.CW_LPF_Filter = 900;
			else if (TRX.CW_LPF_Filter == 900)
				TRX.CW_LPF_Filter = 950;
			else if (TRX.CW_LPF_Filter == 950)
				TRX.CW_LPF_Filter = 1000;
			sprintf(str, "BW: %d",TRX.CW_LPF_Filter);
		break;
		
		case TRX_MODE_NFM:
		case TRX_MODE_WFM:
			if (TRX.FM_LPF_Filter == 5000)
				TRX.FM_LPF_Filter = 6000;
			else if (TRX.FM_LPF_Filter == 6000)
				TRX.FM_LPF_Filter = 7000;
			else if (TRX.FM_LPF_Filter == 7000)
				TRX.FM_LPF_Filter = 8000;
			else if (TRX.FM_LPF_Filter == 8000)
				TRX.FM_LPF_Filter = 9000;
			else if (TRX.FM_LPF_Filter == 9000)
				TRX.FM_LPF_Filter = 10000;
			else if (TRX.FM_LPF_Filter == 10000)
				TRX.FM_LPF_Filter = 15000;
			else if (TRX.FM_LPF_Filter == 15000)
				TRX.FM_LPF_Filter = 20000;
			sprintf(str, "BW: %d",TRX.FM_LPF_Filter);
		break;
		
		case TRX_MODE_AM:
			if (TRX.AM_LPF_Filter == 2100)
				TRX.AM_LPF_Filter = 2300;
			else if (TRX.AM_LPF_Filter == 2300)
				TRX.AM_LPF_Filter = 2500;
			else if (TRX.AM_LPF_Filter == 2500)
				TRX.AM_LPF_Filter = 2700;
			else if (TRX.AM_LPF_Filter == 2700)
				TRX.AM_LPF_Filter = 2900;
			else if (TRX.AM_LPF_Filter == 2900)
				TRX.AM_LPF_Filter = 3000;
			else if (TRX.AM_LPF_Filter == 3000)
				TRX.AM_LPF_Filter = 3200;
			else if (TRX.AM_LPF_Filter == 3200)
				TRX.AM_LPF_Filter = 3400;
			else if (TRX.AM_LPF_Filter == 3400)
				TRX.AM_LPF_Filter = 3600;
			else if (TRX.AM_LPF_Filter == 3600)
				TRX.AM_LPF_Filter = 3800;
			else if (TRX.AM_LPF_Filter == 3800)
				TRX.AM_LPF_Filter = 4000;
			else if (TRX.AM_LPF_Filter == 4000)
				TRX.AM_LPF_Filter = 4500;
			else if (TRX.AM_LPF_Filter == 4500)
				TRX.AM_LPF_Filter = 5000;
			else if (TRX.AM_LPF_Filter == 5000)
				TRX.AM_LPF_Filter = 6000;
			else if (TRX.AM_LPF_Filter == 6000)
				TRX.AM_LPF_Filter = 7000;
			else if (TRX.AM_LPF_Filter == 7000)
				TRX.AM_LPF_Filter = 8000;
			else if (TRX.AM_LPF_Filter == 8000)
				TRX.AM_LPF_Filter = 9000;
			else if (TRX.AM_LPF_Filter == 9000)
				TRX.AM_LPF_Filter = 10000;
			sprintf(str, "BW: %d",TRX.AM_LPF_Filter);
		break;
	}
	
	TRX_setMode(SecondaryVFO()->Mode, SecondaryVFO());
	TRX_setMode(CurrentVFO()->Mode, CurrentVFO());
	LCD_showTooltip(str);
	NeedSaveSettings = true;
}

